{"_id":{"$oid":"65745cfaae63aca4c3f307b1"},"title":"A Clockwork Orange","description":"In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned.","genre":{"name":"Science Fiction","description":"Science fiction (sometimes shortened to SF or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"releaseYear":1972,"director":{"name":"Stanley Kubrick","bio":"Stanley Kubrick was an American film director, producer, screenwriter and photographer. Widely considered one of the greatest filmmakers of all time, his films—nearly all of which are adaptations of novels or short stories—span a number of genres and are known for their intense attention to detail, innovative cinematography, extensive set design and dark humor.","birthYear":1928,"deathYear":1999},"imagePath":"aclockworkorange.png","featured":true,"actors":["Malcolm McDowell","Patrick Magee"]}
{"_id":{"$oid":"657469c1ae63aca4c3f307b3"},"title":"Mulholland Drive","description":"After a car wreck on the winding Mulholland Drive renders a woman amnesiac, she and a perky Hollywood-hopeful search for clues and answers across Los Angeles in a twisting venture beyond dreams and reality.","genre":{"name":"Thriller","description":"Thriller is a genre of fiction with numerous, often overlapping, subgenres, including crime, horror, and detective fiction. Thrillers are characterized and defined by the moods they elicit, giving their audiences heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"releaseYear":2001,"director":{"name":"David Lynch","bio":"David Keith Lynch is an American filmmaker, painter, visual artist, musician and actor. Lynch has received critical acclaim for his films, which are often distinguished by their surrealist qualities. He has received numerous accolades, including the Golden Lion in 2006 and an Honorary Academy Award in 2019.","birthYear":1946},"imagePath":"mulhollanddrive.png","featured":true,"actors":["Naomi Watts","Laura Harring"]}
{"_id":{"$oid":"65746fccae63aca4c3f307b4"},"title":"The Shining","description":"A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.","genre":{"name":"Horror","description":"Horror is a film genre that seeks to elicit fear or disgust in its audience for entertainment purposes. Horror films often explore dark subject matter and may deal with transgressive topics or themes. Broad elements include monsters, apocalyptic events, and religious or folk beliefs."},"releaseYear":1980,"director":{"name":"Stanley Kubrick","bio":"Stanley Kubrick was an American film director, producer, screenwriter and photographer. Widely considered one of the greatest filmmakers of all time, his films—nearly all of which are adaptations of novels or short stories—span a number of genres and are known for their intense attention to detail, innovative cinematography, extensive set design and dark humor.","birthYear":1928,"deathYear":1999},"imagePath":"theshining.png","featured":false,"actors":["Jack Nicholson","Shelley Duvall"]}
{"_id":{"$oid":"657471c8ae63aca4c3f307b5"},"title":"8 1/2","description":"A harried movie director retreats into his memories and fantasies.","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"releaseYear":1963,"director":{"name":"Federico Fellini","bio":"Federico Fellini was an Italian filmmaker. He is known for his distinctive style, which blends fantasy and baroque images with earthiness. He is recognized as one of the greatest and most influential filmmakers of all time.","birthYear":1920,"deathYear":1993},"imagepath":"eightandahalf.png","featured":true,"actors":["Marcello Mastroianni","Anouk Aimée"]}
{"_id":{"$oid":"65747391ae63aca4c3f307b6"},"title":"Brazil","description":"A bureaucrat in a dystopic society becomes an enemy of the state as he pursues the woman of his dreams.","genre":{"name":"Science Fiction","description":"Science fiction (sometimes shortened to SF or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"releaseYear":1985,"director":{"name":"Terry Gilliam","bio":"Terry Gilliam is a British filmmaker, comedian, animator and actor. He gained stardom as a member of the Monty Python comedy troupe alongside John Cleese, Eric Idle, Michael Palin, Terry Jones, and Graham Chapman.","birthYear":1940},"imagePath":"brazil.png","featured":false,"actors":["Jonathan Pryce","Kim Greist","Robert De Niro"]}
{"_id":{"$oid":"6574758cae63aca4c3f307b7"},"title":"L'Avventura","description":"A woman disappears during a Mediterranean boating trip. During the search, her lover and her best friend become attracted to each other.","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"releaseYear":1960,"director":{"name":"Michelangelo Antonioni","bio":"Michelangelo Antonioni was an Italian director and filmmaker. He is best known for his 'trilogy on modernity and its discontents'—L'Avventura (1960), La Notte (1961), and L'Eclisse (1962)—as well as the English-language film Blowup (1966). His films have been described as 'enigmatic and intricate mood pieces' that feature elusive plots, striking visual composition, and a preoccupation with modern landscapes. His work substantially influenced subsequent art cinema. Antonioni received numerous awards and nominations throughout his career, being the only director to have won the Palme d'Or, the Golden Lion, the Golden Bear and the Golden Leopard.","birthYear":1912,"deathYear":2007},"imagePath":"lavventura.png","featured":true,"actors":["Gabriele Ferzetti","Monica Vitti"]}
{"_id":{"$oid":"65747a06ae63aca4c3f307b8"},"title":"Excalibur","description":"Merlin the magician helps Arthur Pendragon unite the Britons around the Round Table of Camelot, even as dark forces conspire to tear it apart.","genre":{"name":"Fantasy","description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap."},"releaseYear":1981,"director":{"name":"John Boorman","bio":"Sir John Boorman CBE is a British filmmaker. Boorman has directed 22 films and received five Academy Award nominations, twice for Best Director (for Deliverance, and Hope and Glory). He is also credited with creating the first Academy Award screeners to promote The Emerald Forest. In 2004, Boorman received the BAFTA Fellowship for lifetime achievement from the British Academy of Film and Television Arts. In January 2022, Boorman received a knighthood.","birthYear":1933},"imagePath":"excalibur.png","featured":false,"actors":["Nigel Terry","Helen Mirren"]}
{"_id":{"$oid":"65747ccfae63aca4c3f307b9"},"title":"Little Women","description":"Jo March reflects back and forth on her life, telling the beloved story of the March sisters - four young women, each determined to live life on her own terms.","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"releaseYear":2019,"director":{"name":"Greta Gerwig","bio":"Greta Celeste Gerwig is an American actress, writer, and director. Initially known for working on mumblecore films, she has since expanded from acting in and co-writing independent films to directing major studio films. Gerwig was included in the annual Time 100 list of the most influential people in the world in 2018.","birthYear":1983},"imagePath":"littlewomen.png","featured":false,"actors":["Saoirse Ronan","Emma Watson","Florence Pugh","Laura Dern"]}
{"_id":{"$oid":"65747f84ae63aca4c3f307ba"},"title":"Blade Runner","description":"Rick Deckard must pursue and terminate four replicants who stole a ship in space and have returned to Earth to find their creator.","genre":{"name":"Science Fiction","description":"Science fiction (sometimes shortened to SF or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"releaseYear":1982,"director":{"name":"Ridley Scott","bio":"Sir Ridley Scott (born 30 November 1937) is an English filmmaker. He is best known for directing films in the science fiction, crime, and historical drama genres. His work is known for its atmospheric and highly concentrated visual style. Scott has received many accolades, including the BAFTA Fellowship for lifetime achievement in 2018, two Primetime Emmy Awards, and a Golden Globe Award. In 2003, he was knighted by Queen Elizabeth II.","birthYear":1937},"imagePath":"bladerunner.png","featured":true,"actors":["Harrison Ford","Rutger Hauer","Sean Young"]}
{"_id":{"$oid":"65748015ae63aca4c3f307bb"},"name":"Gattaca","description":"A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel.","genre":{"name":"Science Fiction","description":"Science fiction (sometimes shortened to SF or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"releaseYear":1997,"director":{"name":"Andrew Niccol","bio":"Andrew Niccol is a New Zealand screenwriter, producer, and director. He wrote and directed Gattaca (1997), Simone (2002), Lord of War (2005), In Time (2011), The Host (2013), and Good Kill (2014).He wrote and co-produced The Truman Show, which earned him a nomination for the Academy Award for Best Original Screenplay and won him the BAFTA Award in the same category. His films tend to explore social, cultural and political issues, as well as artificial realities, simulations and the male gaze.","birthYear":1964},"imagePath":"gattaca.png","featured":false,"actors":["Ethan Hawke","Uma Thurman","Jude Law"]}
